// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>
#include <algorithm>
#include <iterator>
#include <thread>
#include <Calculator.h>
using namespace std;
void foo(int& s) {
    s = 42;
}

#define ABC 5

namespace AVC
{
#define ABC  2
};

void bar() {
    int answer = 0;
    std::thread t(foo, std::ref(answer));
    t.join();
    std::cout << answer << std::endl;
}

int main()
{
    int a = 2;
    if (a == AVC::ABC)
    {
        std::cout << a << std::endl;
    }
    else
    {
        std::cout << "AAAAAA" << std::endl;
    }
    return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
