// A_Twins.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>
#include <algorithm>
#include <numeric>

int main()
{
    int n = 0;
    std::cin >> n;
    std::vector<int> vi(n);
    int sumLeft = 0, sumRight = 0;
    int cntCoins = 0;
    for (int i = 0; i < n; ++i)
    {
        std::cin >> vi[i];
        sumRight += vi[i];
    }
    std::sort(vi.begin(), vi.end());
    if (sumRight > sumLeft)
        cntCoins = n;
    for (int i = 0; i < n; ++i)
    {
        sumRight -= vi[i];
        sumLeft += vi[i];
        if (sumRight > sumLeft)
        {
            cntCoins--;
        }
        else
            break;
    }
    std::cout << cntCoins;
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
