// dragons.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <deque>
#include <vector>
#include <algorithm>

int main()
{
	int s = 0, n = 0;
	std::cin >> s;
	std::cin >> n;
	std::cout << s <<" " << n << std::endl;
	std::deque<int> x(n);
	std::deque<int> y(n);
	std::deque<std::pair<int, int>> dat(n);
	for (int i = 0; i < n; ++i)
	{
		std::cin >> dat[i].first;
		std::cin >> dat[i].second;
	}
	std::sort(dat.begin(), dat.end());
	auto it = std::upper_bound(dat.begin(), dat.end(), s, [](int s, const auto& el) {return s < el.first; });
	if(it != dat.end())
		std::cout << it->first;
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
