// SubOp.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>

using namespace std;

void calc(vector<int> vi, int sub)
{
    int i = 0;
    while (i < vi.size())
    {
        if (vi.size() == 1)
        {
            cout << vi[0] << endl;
            return;
        }
        sub = vi[i++];
        vi.erase(std::remove(vi.begin(), vi.end(), sub), vi.end());
        for (auto& el : vi)
        {
            el -= sub;
        }
        calc(vi, sub);
    }
}

int main()
{
    int t = 0;
    cin >> t;
    for (int i = 0; i < t; ++i)
    {
        int n = 0, k = 0;
        cin >> n >> k;
        cout << n << " " << k << endl;
        vector<int> vi(n, 0);
        vector<int> viTemp;
        for (auto& el : vi)
            cin >> el;
        int startX = 0;
        viTemp = vi;
        calc(viTemp, 0);
    }
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
