// A_Footbal.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    std::string str;
    std::cin >> str;
    int cnt1 = 0, cnt0 = 0;
    int n = str.size();
    bool isDangerous = false;
    for (int i = 0; i < n; ++i)
    {
        if (str[i] == '0')
        {
            cnt1 = 0;
            cnt0++;
        }
        if (str[i] == '1')
        {
            cnt0 = 0;
            cnt1++;
        }
        if (cnt0 == 7 || cnt1 == 7)
        {
            isDangerous = true;
            break;
        }
    }
    if (isDangerous)
        std::cout << "YES";
    else
        std::cout << "NO";
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
